-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Nov 29, 2023 at 08:14 PM
-- Server version: 10.1.38-MariaDB
-- PHP Version: 7.3.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `flutter-app`
--

-- --------------------------------------------------------

--
-- Table structure for table `comment`
--

CREATE TABLE `comment` (
  `id` int(255) NOT NULL,
  `name` varchar(225) COLLATE utf8_persian_ci NOT NULL,
  `email` varchar(225) COLLATE utf8_persian_ci NOT NULL,
  `content` text COLLATE utf8_persian_ci NOT NULL,
  `product_id` int(10) NOT NULL,
  `parent_id` int(10) NOT NULL,
  `status` int(1) NOT NULL,
  `time` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `comment`
--

INSERT INTO `comment` (`id`, `name`, `email`, `content`, `product_id`, `parent_id`, `status`, `time`) VALUES
(1, 'علیرضا جهانی', 'ali15@gmail.com', 'به نظرم همه چیز این محصول عالیه فقط از بابت قیمت اگر ارزون تر میشد خیلی بهتر بود', 3, 0, 1, 0),
(2, 'محمدرضا علیزاده', 'mm199@gmail.com', 'اگر مثل من دوست دارید همه چیزتون عالی باشه این محصول رو بهتون پیشنهاد میکنم', 3, 0, 1, 0),
(3, 'محمود ', 'mahi16@hotmail.com', 'این محصول از نظر من اصلا هم خوب نیست', 3, 0, 1, 0),
(4, 'شاهین', 'shahin@gmail.com', 'عالی ممنون ازتون', 3, 0, 0, 0),
(5, 'محمود', 'mahi16@hotmail.com', 'من پولمو میخوام', 3, 0, 1, 0),
(6, 'نرگس', 'narges@gmail.com', 'به همتون پیشنهاد میکنم', 3, 0, 1, 0),
(7, 'علیرضا جهانبخش', 'alirezaK@gmail.com', 'یک محصول کاملا رویایی', 3, 0, 1, 0),
(8, 'نسترن', 'nan@gmail.com', 'آشغال همه چیز جنس چینی آشغاله', 3, 0, 1, 0),
(9, 'کیمیا', 'kimichra@gmail.com', 'منکه خوشم نیومد فقط بلدن الکی جیب مردم رو خالی کنن', 2, 0, 1, 0),
(10, 'عارفه داوری', 'aref@gmail.com', 'خیلی خوب بود پیشنهاد میکنم بخرید', 2, 0, 1, 0),
(11, 'مرجان آقائي', 'mari@yahoo.com', 'خرید خوبی بود', 2, 0, 1, 0),
(12, 'سپهر نعمتی\r\n', 'sepehrNemati@gmail.com', 'بسیار کاربردی', 2, 0, 1, 0),
(13, 'بهروز محمدی', 'beh@gmail.com', 'باهاش کلی طراحی انجام دادم و راضی ام', 2, 0, 1, 0),
(14, 'رحیم پاکدلان فرد', 'rahim@gmail.com', 'سی دیش از همه لحاظ خوب بود', 2, 0, 1, 0),
(15, 'سعید محبی', 'saiied@gmail.com', 'با توجه به قیمت مناسب و بسته بندی خوب و لیست ارایه دروس خوبی که دارد خریدش را پیشنهاد میکنم . البته هنوز استفاده نکردم .', 2, 0, 1, 0),
(16, 'سینا حسینی مقدم', 'sin@gmail.com', 'علاوه بر امکانات خوب نصب نسبتا آسونی داشت..', 2, 0, 1, 0),
(17, 'هادی خرمی', 'hadie@gmail.com', 'عالی بود ر نصب کردنش هم راحت بود مطابق راهنمای نصب داخل نرم افزار', 2, 0, 1, 0),
(18, 'مرتضی چهارمحالی', 'morigher@gmail.com', 'عالی و آموزشی است و ذهن فرزندتان را باز و خلاق میسازد', 2, 0, 1, 0),
(19, 'مهدی جمالی', 'mahdi@gmail.com', 'برای من ۵ یا ۶ تا قطعه کم داشت و کارم گیر افتاد\r\nای کاش یه محصول رو کامل به دستت میرسوندن', 1, 0, 1, 0),
(20, 'جواد مظفرزاده\r\n', 'jevad@gmail.com', 'یه کم پیچیده اس ولی اگر دریت مونتاژ بشه بد نیست', 1, 0, 1, 0),
(21, 'مهدی اصغری', 'mehti@gmail.com', 'سلام\r\nمن خریدم\r\nیک قطعه توش کم بود\r\nای کاش از هر قطعه یه دونه زاپاس تو گذاشته بودند\r\nپیشنهاد می کنم بخرید\r\nچون در کل خوب بود', 1, 0, 1, 0),
(22, 'محمد رعد', 'mohammad@gmail.com', 'حرکت خوبی است ، منتها باید از حالت سنتی فروش کالا یک قدم پا فراتر گذاشته و در مسیر آموزش و هدایت اصولی و دریافت بازخورد آن قدم بگذارد.', 1, 0, 1, 0),
(23, 'امیر علی فتاحی\r\n', 'amiiir@gmail.com', 'باسلام حتما بخوانید\r\nمن الان یک ماه که دارم روش کار میکنم ترانزیستور و یکی از ای سی ها سوخت چرا برای اینکه در در دفترچه ذکر نشده که چه کارهایی باید انجام بدیم تا قطعات سالم بمونن\r\nواما درمورد پشتیبان عالی است تمام سوال ها رو با دقت جواب میده‌', 1, 0, 1, 0),
(24, 'صفدر بربری\r\n', 'barbarSafdar@gmail.com', 'برای من که اولین کیت بود یه کم سخته', 1, 0, 1, 0),
(25, 'امنه رضایی\r\n', 'amene@gmail.com', 'قطعات اصلی کار ناقصه.بنابراین کارمونتاژ ناقص میمونه ....هر قسمت که جلو بری میبینی نقص قطعه داری.از کجا باید تهیه بشه.....سطحش هم برای دبیرستانه', 1, 0, 1, 0),
(26, 'محمد اصل فلاح', 'mohammad@gmail.com', 'من برای دختر هفت ساله ام گرفتم . خیلی راضی ام .\r\nبا سپاس از شما', 1, 0, 1, 0),
(27, 'رضا اسماعیلی', 'reza@gmail.com', 'خیلی خوبه ارزش داره ولی مال من درس کار نمیکنه\r\nخوبیش اینه خیلی راهنما داره و پشتیبانی خوب', 1, 0, 1, 0),
(28, 'بهمن ولی پور', 'tir@gmail.com', 'با سلام\r\nکیت فوق‌العاده آیه.خریدش رو پیشنهاد میدم فقط کاش راهنمای چاپی هم داخل بستش بود\r\n\r\nنقاط قوت\r\nعالی در سطح بالا\r\nوسایل قابل قبول\r\nخوش ساخت\r\nدر سطح دانشگاه\r\nنقاط ضعف\r\nعدم وجود راهنمای چاپی\r\nراهنمایی ناقص\r\nعدم خدمات پس از فروش', 1, 0, 1, 0),
(29, 'مصطفی بهادری', 'faghatbahador@gmail.com', 'خیلی سطح بالا توضیح داده شده است', 1, 0, 1, 0),
(30, 'امیررضا کمالی', 'amirrezaKemal@gmail.com', 'من تا به حال سی دی های آموزشی زیاد خریده بودم ولی این یکی اصلا خوب توضیح نمیده و فرد با حالت توضیحات حوصله شما را سر می برد', 1, 0, 1, 0),
(31, 'رضا صاعدی', 'rez@gmail.com', 'به موقع به دستم رسید .لطفا از اساتیدی اسفاده بشه که قدرت بیانشون مناسب باشه و تن صداشون تحت یک خط صاف نباشه', 1, 0, 1, 0),
(32, 'علی قزلباش', 'ali@gmail.com', 'اگه هیچ اطلاعاتی راجع به بورس ندارید خیلی خوبه\r\nولی اگه مبتدی نیستید زیاد به کارتون نمیاد', 1, 0, 1, 0),
(33, 'متین کمی', 'matinkamikeyfi@gmail.com', 'متاسفانه این نرم افزار رو خریدم که از هرجهت ضعیفه\r\nچه طراحی نرم افزار که فقط یه پاورپوینته و از روی پاورپوینت مطالب رو میخونه تصاویر بسیار نارسا و بی کیفیت مطالب بسیار پراکنده و بدون انسجام و پیش پا افتاده\r\nاصلا جنبه آموزشی نداره و صرفا یه کپی پیست مطالب اینترنت بیشتر نبود', 1, 0, 1, 0),
(34, 'یاسر رضائیان', 'manyaseram@gmail.com', 'میشه گفت یک انتخاب مناسب برای مبتدی هاست ولی خیلی از مطالب ابتر مونده مثل توضیح فیبوناچی و فیلتر ها و ...', 1, 0, 1, 0),
(35, 'محمد ستایش روحی\r\n', 'mohammad@gmail.com', 'همچیزو یاد میده با همه چیز آشنا میشی خیلی خوبه فقط وقت دارید بخرید تو بیکاری آموزش ببیند وقت مرده نداشته باشد من خودم همین کارو کردم پیشنهاد میکنم عالی هستش', 1, 0, 1, 0),
(36, 'فائزه داداشی', 'faeze@gmail.com', 'کتاب خوبیه برای اونایی که هیچ اطلاعاتی راجع به بورس ندارن\r\nتقریبا همه چیو کامل توضیح داده', 1, 0, 1, 0),
(37, 'سروش محمدعلی زاده\r\n', 'soroosh@gmail.com', 'گر هیچ اشنایی با بورس و اصطلاحات معمولی اون ندارین این کتاب شروع خیلی خوبیه', 2, 0, 1, 0),
(38, 'علی رجایی', 'mrrajayi@gmail.com', 'با این قیمت اصلا نمی ارزه خیلی از مطالبش کاربردی نیست و فقط جهت اطلاع و آگاهی هست کتاب کاملی نیست .و نسبت به قیمتش نمی ارزه', 2, 0, 1, 0),
(39, 'مهدی معظمی گودرزی\r\n', 'mehti@gmail.com', 'بسیارعالی ومناسب', 2, 0, 1, 0),
(40, 'سپیده کشاورز', 'sepide@gmail.com', 'برای شروع خوبه اما کافی نیست باید کتاب های دیگر نیز استفاده کنید.', 2, 0, 1, 0),
(41, 'سمانه جباری', 'smjabar@gmail.com', 'خوشحالم از اینکه هر چی میخام با کیفیت میتونم از دیجی کالا تهیه کنم لطفاً محصولات فرهنگی را بیشتر وبا تخفیف ارائه بدید', 2, 0, 1, 0),
(42, 'جواد شعبانی', 'jevad@gmail.com', 'بینید تو این مجموعه 4 تا dvd هستش، یعنی دوتا پک دوتایی، تو هر پک یکی از dvd ها افیس 2019 هستش،یعنی دوتا از ذی دی دی ها فقط نرم افزار افیس هستن، دوتای دیگ هم تقریبا یک پنجم دی وی دی پر شده، بقیه خالیه، به عبارتی میشد چهار تا دی وی دی، بشه دوتا', 2, 0, 1, 0),
(43, 'حامد الماسی\r\n', 'hamed@gmail.com', 'پولتون رو دور نریزین اصلا وقت نذاشتن، یکی برا خودش حرف میزنه انگار ن انگار میخاد آموزش بده\r\nبرا خودش الکی میچرخه میگه اینو بخرین این راحته این سایت قشنگیه اینو ولش کن کلا انگار داره با یکی حرف میزنه ک از خودش بهتر میفهمه و این راه رو کامل رفته.', 2, 0, 1, 0),
(44, 'بهرام خیرنیا\r\n', 'bahram@gmail.com', 'اگه دنبال آموزش بازاریابی دیجیتال و بورس تکنیکال هستید به شدت توصیه می شه', 2, 0, 1, 0),
(45, 'محمد ابراهیم رادمرد', 'mamad@gmail.com', 'خوبه ولی برای من طرح اصلی فوتوشاپ منظم و وسط نیست', 3, 0, 1, 0),
(46, 'اهورا کرمی', 'kerm@gmail.com', 'ps مخفف همون فتوشاپ هستش . این پیکسل طرفدارای خاص خودش رو داره و معمولا گرافیست ها و کسانی که کار تصویر انجام میدن براشون جذابه همچین چیزی .', 3, 0, 1, 0);

-- --------------------------------------------------------

--
-- Table structure for table `product`
--

CREATE TABLE `product` (
  `id` int(11) NOT NULL,
  `title` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `img_url` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `price` int(255) NOT NULL,
  `order_number` int(7) NOT NULL,
  `content` text COLLATE utf8_persian_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `product`
--

INSERT INTO `product` (`id`, `title`, `img_url`, `price`, `order_number`, `content`) VALUES
(3, 'دوره جامع دارت فلاتر برای مبتددیان فلاتر صد قسمت ', 'images/saba.jpg', 42000000, 7, 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.'),
(4, 'دوره اموزشی lareval', 'images/dody.jpg', 780000000, 3, ''),
(6, 'اموزش و طراحی لوگو', 'images/baba.jpg', 270000000, 9, '');

-- --------------------------------------------------------

--
-- Table structure for table `sliders`
--

CREATE TABLE `sliders` (
  `id` int(225) NOT NULL,
  `img_url` varchar(500) COLLATE utf16_persian_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf16 COLLATE=utf16_persian_ci;

--
-- Dumping data for table `sliders`
--

INSERT INTO `sliders` (`id`, `img_url`) VALUES
(1, 'sliders/im.jpg'),
(2, 'sliders/in.jpg');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `comment`
--
ALTER TABLE `comment`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `sliders`
--
ALTER TABLE `sliders`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `comment`
--
ALTER TABLE `comment`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=47;

--
-- AUTO_INCREMENT for table `product`
--
ALTER TABLE `product`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `sliders`
--
ALTER TABLE `sliders`
  MODIFY `id` int(225) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
